#Напишіть програму на Python, яка повертатиме true, якщо два задані цілі значення рівні або їх сума чи різниця дорівнює 5.  
a = int(input('Введіть перше число= '))
b = int(input('Введіть друге число= '))
s = a + b
r = a - b
if a == b:
    t= True
    print('Значення a=b за умовою це  %s' % t)
elif r == 5:
    t= True
    print('Різниця чисел дорівнює 5 за умовою це  %s' % t)
elif s == 5:
    t = True
    print('Сума чисел дорівнює 5 за умовою це  %s' % t)
else:
    t=False
    print('Жодна з умов не підходить за умовою це %s' % t) 